import { Dispatch, SetStateAction, useState } from "react";

type Props = {
  setPredict: Dispatch<SetStateAction<{}>>;
};

export function PredictButton({ setPredict }: Props) {
  const [isHover, setHover] = useState(false);
  const handleClick = async () => {
    const res = await fetch("/predict");
    // setPredict(await res.json());
    setPredict({
      กรุงธนเหนือ_sidewalk: 9.113667637917638,
      กรุงธนเหนือ_light: 6.009781277179661,
      กรุงธนเหนือ_road: 11.66756267833474,
      กรุงเทพกลาง_sidewalk: 14.259446220446218,
      กรุงเทพกลาง_light: 8.019348360754913,
      กรุงเทพกลาง_road: 20.784425557285854,
      กรุงธนใต้_sidewalk: 8.654201326451327,
      กรุงธนใต้_light: 6.225890653657545,
      กรุงธนใต้_road: 12.193364791254501,
      กรุงเทพตะวันออก_sidewalk: 14.978360916860927,
      กรุงเทพตะวันออก_light: 7.321043576600329,
      กรุงเทพตะวันออก_road: 17.166377810914575,
      กรุงเทพใต้_sidewalk: 18.93208021145522,
      กรุงเทพใต้_light: 9.049055507060919,
      กรุงเทพใต้_road: 24.29095830476713,
      กรุงเทพเหนือ_sidewalk: 13.452855725973377,
      กรุงเทพเหนือ_light: 11.250409108642462,
      กรุงเทพเหนือ_road: 22.530776560396124,
      กรุงธนเหนือ_sidewalk_1: 11.326955461205461,
      กรุงธนเหนือ_light_1: 8.73458471282435,
      กรุงธนเหนือ_road_1: 17.686435378347138,
      กรุงเทพกลาง_sidewalk_1: 12.39390482556659,
      กรุงเทพกลาง_light_1: 9.182950212603787,
      กรุงเทพกลาง_road_1: 18.593515850291784,
      กรุงธนใต้_sidewalk_1: 10.81747044622044,
      กรุงธนใต้_light_1: 9.008046132283758,
      กรุงธนใต้_road_1: 18.360227489186084,
      กรุงเทพตะวันออก_sidewalk_1: 13.816714466905648,
      กรุงเทพตะวันออก_light_1: 11.658212209408445,
      กรุงเทพตะวันออก_road_1: 20.7415973160912,
      กรุงเทพใต้_sidewalk_1: 15.221356476856474,
      กรุงเทพใต้_light_1: 10.237200138813513,
      กรุงเทพใต้_road_1: 23.51501813121519,
      กรุงเทพเหนือ_sidewalk_1: 15.74267722555223,
      กรุงเทพเหนือ_light_1: 11.337052496869223,
      กรุงเทพเหนือ_road_1: 23.50685627050108,
      กรุงธนเหนือ_sidewalk_2: 12.364700688200687,
      กรุงธนเหนือ_light_2: 8.97458103145869,
      กรุงธนเหนือ_road_2: 19.448423955129837,
      กรุงเทพกลาง_sidewalk_2: 14.203078532578534,
      กรุงเทพกลาง_light_2: 9.094172092474437,
      กรุงเทพกลาง_road_2: 19.010465587903667,
      กรุงธนใต้_sidewalk_2: 11.60765975690976,
      กรุงธนใต้_light_2: 8.528371551213045,
      กรุงธนใต้_road_2: 20.064229281511402,
      กรุงเทพตะวันออก_sidewalk_2: 14.444856143856141,
      กรุงเทพตะวันออก_light_2: 10.91640025202882,
      กรุงเทพตะวันออก_road_2: 20.860752487880195,
      กรุงเทพใต้_sidewalk_2: 19.269427796060146,
      กรุงเทพใต้_light_2: 10.851279420865923,
      กรุงเทพใต้_road_2: 22.31511376385912,
      กรุงเทพเหนือ_sidewalk_2: 18.67587176712177,
      กรุงเทพเหนือ_light_2: 11.383666663963877,
      กรุงเทพเหนือ_road_2: 21.58342102570631,
    });
  };

  const extraStyle = isHover
    ? {
        backgroundColor: "#005a9e",
        color: "white",
      }
    : {
        backgroundColor: "#0078d4",
        color: "#ffd21f",
      };

  return (
    <div
      style={{
        display: "inline-block",
        padding: "5px 10px",
        border: "1px solid #0078d4",
        borderRadius: "5px",
        transition: "all 0.2s ease",
        cursor: "pointer",
        ...extraStyle,
      }}
      onMouseEnter={() => setHover(true)}
      onMouseLeave={() => setHover(false)}
      onClick={handleClick}
    >
      Predict!
    </div>
  );
}
